===
infix op
===
y = 5 + 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))
===
prefix op
===
y = (+) 5 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (function_application
                    (operator)
                    (function_param
                        (nat)))
                (function_param
                    (nat))))))
===
regular function
===
x = myFunc 1 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (function_application
                    (identifier)
                    (function_param
                        (nat)))
                (function_param
                    (nat))))))
===
infix operator function
===
x = 1 <<- 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))