===
identifier: relative
===
x = foo.bar.baz
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (path)
            (wordy_id))))
===
identifier: simple
===
x = baz
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (wordy_id))))
===
identifier: symop
===
x = 1 + 1
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))
===
[Identifier] operator with path
===
> 1 Nat.== 1
---
(unison (watch_expression (function_application (nat) (path) (operator) (nat))))