===
[Literal] text
===
x = "Test"
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_text))))
===
[Literal] Nat
===
x = 123
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (nat))))
===
[Literal] Int
===
x = -9223372036854775808
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (int))))
===
[Literal] Float
===
x = 1.6777216
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (float))))
===
[Literal] Char
===
x = ?a
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_char))))
===
[Literal] Boolean
===
x = true
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_boolean))))
===
[Literal] Byte
===
x = 0xsdeadbeef
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_byte))))
===
[Literal] hash literal
===
x = #a0v829
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_hash))))
===
[Literal] list literal
===
x = [1, 2, 3]
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_list
                (nat)
                (nat)
                (nat)))))
===
[Literal] function
===
y = x -> x + 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_literal
                (wordy_id)
                (right_arrow)
                (function_application
                    (wordy_id)
                    (operator)
                    (nat))))))
===
[Literal] tuple
===
x = (true, true, false)
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_tuple
                (literal_boolean)
                (literal_boolean)
                (literal_boolean)))))
===
[Literal] unit
===
x = ()
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_tuple))))
===
[Literal] termLink
===
x = termLink aUnisonTerm
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_termlink
                (kw_termlink)
                (wordy_id)))))
===
[Literal] typeLink
===
x = typeLink Optional
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_typelink
                (kw_typelink)
                (type
                    (wordy_id))))))
