===
text literal
===
x = "Test"
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_text))))
===
Nat
===
x = 123
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (nat))))
===
Int
===
x = -9223372036854775808
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (int))))
===
Float
===
x = 1.6777216
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (float))))
===
Char
===
x = ?a
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_char))))
===
Boolean
===
x = true
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_boolean))))
===
Byte
===
x = 0xsdeadbeef
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_byte))))
===
hash literal
===
x = #a0v829
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_hash))))
===
list literal
===
x = [1, 2, 3]
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_list
                (nat)
                (nat)
                (nat)))))
===
function literal
===
y = x -> x + 2
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (identifier)
                (operator)
                (nat)))))
===
tuple literal
===
x = (true, true, false)
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_tuple
                (literal_boolean)
                (literal_boolean)
                (literal_boolean)))))
===
unit tuple literal
===
x = ()
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_tuple))))
===
termLink literal
===
x = termLink aUnisonTerm
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_termlink
                (kw_termlink)
                (wordy_id)))))
===
typeLink literal
===
x = typeLink Optional
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (literal_typelink
                (kw_typelink)
                (type
                    (wordy_id))))))
